# Задача 1. Вывести квадрат числа
# a = int(input('Введите число:'))
# print(f'квадрат числа {a} = {a**2}')

## print('Введите число:' )
## a = int(input())
## print(a**2)

# Задача 2. Принимает на вход 2 числа и проверяет, является ли одно квадратом другого#
## a = int(input('Введите число a:'))
## b = int(input('Введите число b:'))

# a,b = int(input('Введите число a:')),int(input('Введите число b:'))
# if a == b ** 2 or b == a ** 2:
#     print('Да, является')
# else:
#     print('Нет, не является')

## if a == b ** 2:
##     print('Да, является')
## elif b == a ** 2:
##     print('Да, является')
## else:
##     print('Нет, не является')

# c = input().split()
# a = int(c[0])
# b = int(c[1])
# my_st = "Пример строки Python"
# print(my_st.split())

# Задача 3. Нахождение максимального из 5 чисел

# print(max(list(map(int(input().split())))))

# a = list(map(int(input().split())))
# maximum = max(a)
# print(maximum)

# c1 = int(input())
# max = c1
# for i in range(5):
#     c1 = int(input())
#     if c1 > max:
#         max = c1
# print(max)

# Задача 4. Принимает число N и выводит числа от -N до N
# n = int(input())
# for i in range(-n, n+1, 1):
#     print(i)

