# 3. Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# *Пример:*
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

list1 = [4.79, 1.12, 3.122, 5.34, 10.42]
print(list1)
list2 = []
for i in range((len(list1))):
    i = list1[i]%1
    list2.append(float(i))
# print(list2)
list2.sort()
# print(list2)
print(f'Разница: {list2[-1]} - {list2[0]} =', list2[-1] - list2[0])