#  Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. В качестве символа-разделителя используйте пробел.
# Ввод: 2 3 5 -> 2 5
hello = "Hello world"
nums = [1, 2, 3, 4]
print(hello[::-1])
print(nums[::-1])